## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                 RESOURCE                  |
|----------|-------------------------------------------|
| update   | `module.ecs.aws_ecs_service.this`         |
| recreate | `module.ecs.aws_ecs_task_definition.this` |

| CHANGE |           OUTPUT           |
|--------|----------------------------|
| update | `task_definition_arn`      |
|        | `task_definition_revision` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "blawx-staging-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:278626299035:service/blawx-staging-cluster/blawx-staging-service"
        name                               = "blawx-staging-service"
        tags                               = {
            "CostCentre" = "blawx-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "blawx-staging-service:27" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "lexpedite/blawx:latest" -> "278626299035.dkr.ecr.ca-central-1.amazonaws.com/blawx-staging:latest"
                    name                   = "blawx-container"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "blawx-staging-service" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
        tags                     = {
            "CostCentre" = "blawx-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ task_definition_arn       = "arn:aws:ecs:ca-central-1:278626299035:task-definition/blawx-staging-service:25" -> (known after apply)
  ~ task_definition_revision  = 25 -> (known after apply)

Warning: Deprecated attribute

  on .terraform/modules/ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.ecs.aws_service_discovery_service.this,
  on .terraform/modules/ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
